Repository: muharamdani/HydraPaper
Catalog: po/*.po
Languages: fr

source: Error: you passed {0} wallpapers for {1} monitors
fr: Erreur : vous avez passé {0} fonds d'écran pour {1} écrans

source: Error: you passed {0} modes for {1} wallpapers
fr: Erreur : vous avez passé {0} modes pour {1} fonds d'écran

source: Error: wallpaper mode {0} is not valid. Allowed values are: zoom, fit_black, fit_blur, center_black, center_blur
fr: Erreur : le mode de fond d'écran {0} n'est pas valide. Les valeurs autorisées sont : zoom, centré_noir, centré_flou, ajusté_noir, ajusté_flou

source: Error: {0} is not a valid image path
fr: Erreur : {0} n'est pas un chemin d'image valide

source: set wallpapers from command line
fr: définir les fonds d'écran par ligne de commande

source: specify the modes for the wallpapers (zoom, center_black, center_blur, fit_black, fit_blur)
fr: spécifier les modes pour les fonds d'écran (zoom, centré_noir, centré_flou, ajusté_noir, ajusté_flou)

source: set the dark mode wallpapers (specific to GNOME 42+)
fr: définir les fonds d'écran de mode sombre (pour GNOME 42+)

source: set wallpapers randomly
fr: définir les fonds d'écran de manière aléatoire

source: Choose a folder
fr: Choisissez un dossier

source: Wallpapers
fr: Fonds d'écran

source: Favorites
fr: Favoris

source: Error parsing monitors (Gdk)
fr: Erreur lors de l'analyse des écrans (Gdk)

source: Combined spanned monitor
fr: Écran combiné étendu

source: Start daemon on login
fr: Démarrer le daemon lors de la connexion

source: React to monitor changes and start slideshow mode
fr: Réagir au changement d'écran et commencer le mode diaporama

source: Save each wallpaper separately
fr: Enregistrer chaque fond d'écran séparément

source: Warning: this feature will use a lot of disk space. Periodically clear the cache to mitigate this problem
fr: Attention : cette fonctionnalité utilisera beaucoup d'espace disque. Videz le cache périodiquement pour éviter ce problème

source: Enable daemon
fr: Activer le daemon

source: Needed for slideshow mode and to detect display changes
fr: Utilisé pour le mode diaporama et détecter les changements d'affichage

source: General
fr: Général

source: General preferences
fr: Paramètres généraux

source: Cache and favorites
fr: Cache et favoris

source: Clear favorites
fr: Vider les favoris

source: Clear
fr: Vider

source: Clear caches
fr: Vider le cache

source: Appearance
fr: Apparence

source: Appearance preferences
fr: Préférences d'apparence

source: Dark mode
fr: Mode sombre

source: Use big thumbnails for the monitors previews
fr: Utiliser de grandes miniatures pour la prévisualisation des écrans

source: Show full path in folder view
fr: Montrer le chemin entier dans la vue des dossiers

source: Move up
fr: Déplacer vers le haut

source: Remove
fr: Supprimer

source: Move down
fr: Déplacer vers le bas

source: Remove favorite
fr: Supprimer des favoris

source: Add favorite
fr: Ajouter aux favoris

source: ERROR: cannot create thumbnail for file
fr: Erreur : impossible de créer une miniature pour le fichier

source: Add wallpaper folders
fr: Ajouter des dossiers de fonds d'écran

source: Single Spanned Wallpaper Mode
fr: Mode fond d'écran unique étendu

source: Set Random Wallpapers
fr: Définir des fonds d'écran aléatoires

source: Preferences
fr: Préférences

source: Shortcuts
fr: Raccourcis

source: About HydraPaper
fr: À propos de HydraPaper

source: Wallpaper Folders
fr: Dossiers de fonds d'écran

source: Search
fr: Rechercher

source: Apply for Dark Mode
fr: Appliquer pour le mode sombre

source: Apply
fr: Appliquer

source: Add to Slideshow
fr: Ajouter au diaporama

source: Manage Slideshow Mode
fr: Gérer le mode diaporama

source: Slideshow Mode
fr: Mode diaporama

source: Wallpaper duration
fr: Durée du fond d'écran

source: Wallpaper Mode
fr: Mode de fond d'écran

source: Open Keyboard Shortcuts
fr: Ouvrir les Raccourcis clavier

source: Open Menu
fr: Ouvrir le Menu

source: Open Preferences
fr: Ouvrir les Préférences

source: Quit
fr: Quitter

source: Add Favorite
fr: Ajouter aux favoris

source: Path:
fr: Chemin :

source: Add Folder
fr: Ajouter le dossier

source: Remove Folder
fr: Supprimer le dossier

source: Activate All Folders
fr: Activer tous les dossiers

source: Deactivate All Folders
fr: Désactiver tous les dossiers

source: Fit (black background)
fr: Ajuster (fond noir)

source: Fit (blur)
fr: Ajuster (flou)

source: Center (black backgrond)
fr: Centrer (fond noir)

source: Center (blur)
fr: Centrer (flou)

source: Daemon for HydraPaper
fr: Daemon pour HydraPaper

source: Wallpaper manager with multimonitor support
fr: Gestionnaire de fonds d'écran avec support pour de multiples écrans

source: wallpaper;background;monitor;
fr: wallpaper;background;monitor;écran;arrière-plan;fond;

source: Set random wallpapers
fr: Définir des fonds d'écran aléatoires

source: Wallpaper manager with multi monitor support
fr: Gestionnaire de fonds d'écran avec support pour de multiples écrans

source: HydraPaper is a wallpaper manager, specifically designed to work around the lack of functionality of many desktop environments to set a different wallpaper for each monitor in a multi monitor setup. It accomplishes this by scaling and merging different wallpapers into a single one and setting it as spanned.
fr: HydraPaper est un gestionnaire de fonds d'écran, étudié spécialement pour contourner le manque de fonctionnalité de nombreux environnements de bureau pour définir un fond d'écran différent pour chaque écran, dans une configuration multi-écrans. Il permet cela en mettant à l'échelle et en fusionnant différents fonds d'écran en un seul et en le définissant comme étendu.

source: It currently supports various desktop environments, including GNOME, MATE, Cinnamon and Budgie. Experimental support is included for the sway window manager.
fr: Il supporte actuellement différents environnements de bureau incluant GNOME, MATE, Cinnamon et Budgie. Un support expérimental est inclus pour le gestionnaire de fenêtre sway.

source: Show apply button for dark mode in Ubuntu GNOME sessions
fr: Montre le bouton « appliquer » pour le mode sombre dans les sessions Ubuntu GNOME

source: Added separate apply button for dark mode
fr: Ajout d'un bouton « appliquer » séparé pour le mode sombre

source: Show wallpaper names
fr: Montre les noms des fonds d'écran

source: Added search for file name and resolution
fr: Ajout de la recherche par nom de fichier et résolution

source: Wallpaper folder selection popover converted to Flap (auto-hide sidebar)
fr: Le fenêtre contextuelle de sélection des dossiers de fond d'écran a été convertie en volet (masquage automatique de la barre latérale).

source: Updated support for libadwaita to version 1.0.0.alpha.4
fr: Mise à jour du support pour libadwaita vers la version 1.0.0.alpha.4

source: Fixed window size save/restore
fr: Correction de l'enregistrement / restauration de la taille de la fenêtre

source: Added support for heterogeneous DPI scaling
fr: Ajout de la prise en charge de la mise à l'échelle pour des DPI hétérogènes

source: Added support for libadwaita 1.0.0-alpha.2
fr: Ajout du support pour libadwaita 1.0.0-alpha.2

source: 🚀 HydraPaper has been updated to GTK4 and libadwaita!
fr: 🚀 HydraPaper a été mis à jour vers GTK4 et libadwaita !

source: Bug fixes for Fit and Center wallpaper modes
fr: Correction de bogues pour les modes de fond d'écran Ajusté et Centré

source: Minor improvements to the UI
fr: Améliorations mineures pour l'interface

source: Improved phone compatibility
fr: Compatibilité pour les téléphones améliorée

source: Fix for different wallpaper modes not working on single display setups
fr: Correction pour différents modes de fond d'écran ne fonctionnant pas sur des configurations comportant un seul écran

source: Fixed random wallpaper
fr: Correction de la fonction fond d'écran aléatoire

source: Updated to the latest version of libhandy
fr: Mise à jour vers la dernière version de libhandy

source: New option to set a single wallpaper as spanned across all the monitors
fr: Nouvelle option pour définir un unique fond d'écran étendu pour tous les écrans

source: Added Cinnamon support
fr: Ajout du support pour l'environnement de bureau Cinnamon

source: New wallpaper modes: set your wallpapers as zoomed, centered or fitted, with the choice of either a black or a blurred background
fr: Nouveaux modes de fonds d'écran : définissez vos fonds d'écran comme agrandis, centrés ou ajustés, avec le choix d'un fond noir ou flou

source: Various improvements and bug fixes
fr: Diverses améliorations et corrections de bogues

source: Added Brazilian Portuguese translation
fr: Ajout d'une traduction en portugais brésilien

source: Updated to support the latest version of libhandy
fr: Mise à jour vers la dernière version de libhandy

source: Added more keyboard shortcuts
fr: Ajout de plus de raccourcis clavier

source: New icon courtesy of Tobias Bernard
fr: Nouvelle icône grâce à Tobias Bernard

source: New minimal favorite wallpaper badge
fr: Nouveau badge minimaliste de fond d'écran favori

source: New quick buttons to toggle on/off all wallpaper folders at once
fr: Nouveaux boutons rapides pour activer / désactiver tous les dossiers de fonds d'écran à la fois

source: Updated flatpak dependencies and GNOME runtime
fr: Mise à jour des dépendances flatpak et de l'environnement d'exécution GNOME

source: Removed libwnck dependency and functionalities (lower other windows toggle)
fr: Suppression de la dépendance et des fonctionnalités de libwnck (bouton pour minimiser d'autres fenêtres)

source: Various bug fixes
fr: Diverses corrections de bogues

source: You can now set lockscreen wallpapers from the command line
fr: Vous pouvez désormais définir des fonds d'écran de verrouillage depuis la commande en ligne

source: New preference to save wallpapers with random names
fr: Nouveau paramètre pour enregistrer des fonds d'écran avec des noms aléatoires

source: Various bug fixes and improvements
fr: Diverses corrections de bogues et améliorations

source: Ordering wallpapers folders alphabetically
fr: Tri des dossiers d'arrière-plans par ordre alphabétique

source: Fixed folder adding
fr: Correction de l'ajout de dossiers

source: You can now add multiple folders at once!
fr: Vous pouvez maintenant ajouter de multiples dossiers en une fois !

source: Slight design overhaul
fr: Légère refonte du design

source: Added German and Russian translations (courtesy of Alessandra Gallia)
fr: Ajout de traductions en allemand et en russe (grâce à Alessandra Gallia)

source: Redesigned symbolic icon
fr: Redesign de l'icône symbolique

source: Initial support for sway (still broken in Flatpak)
fr: Support initial pour sway (ne marche pas pour les installations Flatpak)

source: Small performance improvements
fr: Petites améliorations de performance

source: Fixed conflict between desktop and lockscreen wallpapers
fr: Corrige le conflit entre fond d'écran de bureau et de verrouillage

source: Merged wallpapers aren't cached anymore. Just keep one and save lots of space
fr: Les fonds d'écran fusionnés ne sont plus mis en cache. Gardez-en un et économisez beaucoup d'espace

source: Fixed path enable/disable bug
fr: Corrige le bogue d'activation / désactivation des chemins

source: Moved app menu to the far right
fr: Menu d'application déplacé tout à droite

source: Added view switcher bar when window is too small
fr: Ajout d'une barre de changement d'affichage lorsque la fenêtre est trop petite

source: Added option to set lockscreen wallpapers in GNOME
fr: Ajout d'une option pour définir un fond d'écran de verrouillage pour GNOME

source: Internationalization support and Italian translation
fr: Support de traductions multilingues et traduction italienne

source: New widgets from Purism's libhandy
fr: Nouveaux widgets dans le style libhandy de Purism

source: Removed animated spinner
fr: Suppression de la toupie animée

source: Paths in folders view show only the folder name by default
fr: Les chemins dans la vue des dossiers montrent seulement le nom du dossier par défaut

source: New website
fr: Nouveau site web

source: Properly implemented MATE support
fr: Support pour MATE implémenté proprement

source: Added post-installation commands
fr: Ajout de commandes post-installation

source: Fixing wrong import
fr: Correction du mauvais import

source: Fixed support for MATE under Flatpak
fr: Correction du support pour MATE pour les Flatpaks

source: New icon! Should be closer to GNOME HIG.
fr: Nouvelle icône ! Plus proche des directives d'interface de GNOME.

source: Exposed random wallpaper functionality from the in-app menu and desktop file
fr: Exposition de la fonctionnalité de fond d'écran aléatoire depuis le menu de l'application et le fichier de bureau

source: Added random wallpaper functionality from command line with -r option
fr: Ajout d'une fonctionnalité d'arrière-plans aléatoires en ligne de commande avec l'option -r

source: Fixing startup error when added folders get deleted
fr: Correction de l'erreur de démarrage quand des dossiers ajoutés sont supprimés

source: Get correct localized Pictures folder on first startup
fr: Dossier d'images localisé correct au premier démarrage

source: App doesn't crash anymore if a folder doesn't exist
fr: L'application ne plante plus si un dossier n'existe pas

source: Fixed wallpapers not hiding on startup
fr: Correction des arrière-plans non-cachés au démarrage

source: Complete code refactoring
fr: Refonte complète du code

source: Made the whole build system more modular
fr: Ensemble du système de construction rendu plus modulaire

source: Moved app menu to the headerbar
fr: Menu d'application déplacé vers la barre du haut

source: Initial support for keyboard shortcuts
fr: Support initial pour les raccourcis clavier

source: Fixed thumbnail creation for PNGs with alpha channel
fr: Corrige la création de vignettes pour fichiers PNG avec le canal alpha

source: Added option to clear cache
fr: Ajout d'une option pour vider le cache

source: Improved thumbnail generation and caching for better performance
fr: Amélioration de la génération de vignettes et de la mise en cache pour de meilleures performances

source: Updated dependencies
fr: Dépendances mises à jour

source: Added support for command line usage
fr: Ajout du support pour l'utilisation en ligne de commande

source: Implemented boilerplate for gtk via gmgtk (gitlab.com/gabmus/gmgtk)
fr: Implémentation de boilerplate pour GTK via gmgtk (gitlab.com/gabmus/gmgtk)

source: Migrated configuration management to gmconfig (gitlab.com/gabmus/gmconfig)
fr: Migration de la gestion de la configuration vers gmconfig (gitlab.com/gabmus/gmconfig)

source: Migrated to GitLab
fr: Migration vers GitLab

source: Better filename generation
fr: Meilleure génération de noms de fichiers

source: Added support for vertical setups
fr: Ajout du support pour les configurations verticales

source: Added symbolic icon
fr: Ajout d'une icône symbolique

source: Added support for MATE
fr: Ajout du support pour MATE

source: Design makeover
fr: Refonte du design

source: Added longpress/rightclick menu
fr: Ajout du menu pression longue / clic droit

source: Implemented favorites
fr: Implémentation des favoris

source: Added option to temporarely disable paths
fr: Ajout de l'option pour désactiver temporairement les chemins

source: Added option to minimize/restore all other windows
fr: Ajout de l'option minimiser / restaurer toutes les autres fenêtres

source: Improved performance
fr: Performance améliorée

source: Various optimizations for flatpak distribution
fr: Diverses optimisations pour la distribution via flatpak

source: Removed the dependency on xmltodict
fr: Suppression de la dépendance sur xmltodict

source: Changed icon
fr: Icône changée

source: Added support for monitors.xml version 1
fr: Ajout du support pour la version 1 de monitors.xml

source: Improved 3+ monitors configuration
fr: Amélioration de la configuration de 3 écrans ou +

source: Remember previously set wallpapers throughout sessions
fr: Mémorise les fonds d'écran précédemment définis tout au long des sessions

source: Implemented cache hitting
fr: Implémentation de la recherche de cache

source: Added checks and user friendly error messages for monitors.xml
fr: Ajout de vérifications et de messages d'erreur conviviaux pour monitors.xml

source: Bug fixes
fr: Correction de bogues

source: Added settings window
fr: Ajout d'une fenêtre de paramètres

source: Port to pillow
fr: Portage vers pillow

source: First release
fr: Première version
